{-
Paper: section 4

Inductive function space part of the initial algebra construction.
-}

{-# OPTIONS --rewriting #-}

import Syntax as S
open import StrictLib hiding (id; _∘_)
import ADS as ADS
open import ADS using (Conʳ; Tyʳ; Tmʳ; Subʳ; ᴬ; ᴰ; ˢ; mkCon; mkTy; mkTm; mkSub)

module InitialAlg.Pi (Ω : S.Con) where

open import InitialAlg.CwF Ω
open import InitialAlg.ElU Ω


-- Inductive functions
--------------------------------------------------------------------------------

Π : {Γ : S.Con} {Γᶜ : Con Γ} {a : S.Tm Γ (S.U {Γ})} (aᶜ : Tm {Γ} Γᶜ
    {S.U {Γ}} (U {Γ} {Γᶜ}) a) {B : S.Ty (Γ S.▶ S.El {Γ} a)} → Ty {Γ
    S.▶ S.El {Γ} a} (_▶_ {Γ} Γᶜ {S.El {Γ} a} (El {Γ} {Γᶜ} {a} aᶜ)) B
    → Ty {Γ} Γᶜ (S.Π {Γ} a B)
Π {Γ}{Γᶜ}{a} aᶜ {B} Bᶜ ν t α =
  let α' = coe (aᶜ ν ⁻¹) α
  in coe ((λ x → Tyʳ B .ᴬ (Γᶜ ν , lift x)) & coecoe⁻¹ (aᶜ ν) α)
         -- cheat: REWRITE specialization needed
         (Bᶜ (ν S.,s α') (coe cheat (S.app t S.[ S.id S.,s α' ]t)))

-- Agda bug seems to prevent this
-- Π[] :
--      {Γ : S.Con} {Γᶜ : Con Γ} {Δ : S.Con} {Δᶜ : Con Δ} {σ : S.Sub Γ Δ}
--      {σᶜ : Sub {Γ} Γᶜ {Δ} Δᶜ σ} {a : S.Tm Δ (S.U {Δ})} {aᶜ : Tm {Δ} Δᶜ
--      {S.U {Δ}} (U {Δ} {Δᶜ}) a} {B : S.Ty (Δ S.▶ S.El {Δ} a)} {Bᶜ : Ty
--      {Δ S.▶ S.El {Δ} a} (_▶_ {Δ} Δᶜ {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ))
--      B} → _≡_ {j} {Ty {Γ} Γᶜ (S.Π {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)
--      (S._[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ S.▶
--      S.El {Δ} a} B (S._,s_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} {Δ} (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)})))))} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.Π {Δ} a B} (Π
--      {Δ} {Δᶜ} {a} aᶜ {B} Bᶜ) {σ} σᶜ) (Π {Γ} {Γᶜ} {S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ} (coe {j} {Tm {Γ} Γᶜ {S.U {Γ}} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ}
--      {S.U {Δ}} (U {Δ} {Δᶜ}) {σ} σᶜ) (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {Tm {Γ} Γᶜ {S.U {Γ}} (U {Γ} {Γᶜ}) (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} (_&_ {j} {suc j} {Ty {Γ} Γᶜ (S.U {Γ})} {Set j} (λ x → Tm {Γ}
--      Γᶜ {S.U {Γ}} x (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)) {_[_]T {Γ} {Γᶜ}
--      {Δ} {Δᶜ} {S.U {Δ}} (U {Δ} {Δᶜ}) {σ} σᶜ} {U {Γ} {Γᶜ}} (U[] {Γ}
--      {Γᶜ} {Δ} {Δᶜ} {σ} {σᶜ})) (_[_]t {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} {U
--      {Δ} {Δᶜ}} {a} aᶜ {σ} σᶜ)) {S._[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} {Δ S.▶ S.El {Δ} a} B (S._,s_ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ} (S._∘_ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})))} (coe {j} {Ty
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_▶_ {Γ} Γᶜ
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ}
--      {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)) (S._[_]T {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ S.▶ S.El {Δ} a} B
--      (S._,s_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ}
--      (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ
--      (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)}))))} {Ty {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} (_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      (El {Γ} {Γᶜ} {S._[_]t {Γ} {Δ} {S.U {Δ}} a σ} (coe {j} {Tm {Γ} Γᶜ
--      {S.U {Γ}} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} (U {Δ} {Δᶜ}) {σ} σᶜ)
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Tm {Γ} Γᶜ {S.U {Γ}} (U {Γ}
--      {Γᶜ}) (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_&_ {j} {suc j} {Ty {Γ}
--      Γᶜ (S.U {Γ})} {Set j} (λ x → Tm {Γ} Γᶜ {S.U {Γ}} x (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)) {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} (U {Δ}
--      {Δᶜ}) {σ} σᶜ} {U {Γ} {Γᶜ}} (U[] {Γ} {Γᶜ} {Δ} {Δᶜ} {σ} {σᶜ}))
--      (_[_]t {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} {U {Δ} {Δᶜ}} {a} aᶜ {σ} σᶜ))))
--      (S._[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ S.▶
--      S.El {Δ} a} B (S._,s_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} {Δ} (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)}))))} (_&_ {j} {suc j} {Ty {Γ} Γᶜ (S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ))} {Set j} (λ x → Ty {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} x) (S._[_]T {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ S.▶ S.El {Δ} a} B (S._,s_ {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ} (S._∘_ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})))))
--      {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ}
--      σᶜ} {El {Γ} {Γᶜ} {S._[_]t {Γ} {Δ} {S.U {Δ}} a σ} (coe {j} {Tm {Γ}
--      Γᶜ {S.U {Γ}} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} (U {Δ} {Δᶜ}) {σ}
--      σᶜ) (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Tm {Γ} Γᶜ {S.U {Γ}} (U {Γ}
--      {Γᶜ}) (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_&_ {j} {suc j} {Ty {Γ}
--      Γᶜ (S.U {Γ})} {Set j} (λ x → Tm {Γ} Γᶜ {S.U {Γ}} x (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)) {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} (U {Δ}
--      {Δᶜ}) {σ} σᶜ} {U {Γ} {Γᶜ}} (U[] {Γ} {Γᶜ} {Δ} {Δᶜ} {σ} {σᶜ}))
--      (_[_]t {Γ} {Γᶜ} {Δ} {Δᶜ} {S.U {Δ}} {U {Δ} {Δᶜ}} {a} aᶜ {σ} σᶜ))}
--      (El[] {Γ} {Γᶜ} {Δ} {Δᶜ} {σ} {σᶜ} {a} {aᶜ})) (_[_]T {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El
--      {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Δ S.▶ S.El {Δ} a} {_▶_ {Δ}
--      Δᶜ {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ)} {B} Bᶜ {S._,s_ {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ} (S._∘_ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)}))) {S.El {Δ} a} (S.π₂ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))} (_,s_ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El
--      {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Δ} {Δᶜ} {S._∘_ {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)}))} (_∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T
--      {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ}
--      {Γᶜ} {Δ} {Δᶜ} {σ} σᶜ {S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})} (π₁ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El
--      {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El
--      {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T
--      {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)})))
--      {S.El {Δ} a} {El {Δ} {Δᶜ} {a} aᶜ} {S.π₂ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})}
--      (coe {j} {Tm {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      (_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ}
--      {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)) {S.El {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S._[_]t {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ} {S.U {Δ}} a (S._∘_
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)}))))} (_[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a}
--      aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ}
--      σᶜ) {S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ}
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})} (π₁ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ}
--      {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a}
--      aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_
--      {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ}
--      {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)}))) (S.π₂ {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)}))} {Tm {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ)
--      {σ} σᶜ)) {S.El {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      (S._[_]t {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ}
--      {S.U {Δ}} a (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))))} (_[_]T {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El
--      {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Δ} {Δᶜ} {S.El {Δ} a} (El
--      {Δ} {Δᶜ} {a} aᶜ) {S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))} (_∘_ {Γ S.▶
--      S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El
--      {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {Δ} {Δᶜ} {σ} σᶜ
--      {S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})} (π₁ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ}
--      {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a}
--      aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_
--      {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ}
--      {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)})))) (S.π₂ {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)}))} (_&_ {j} {suc j} {Ty {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El
--      {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)) (S.El {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (S._[_]t {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {Δ} {S.U {Δ}} a (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})))))}
--      {Set j} (λ x → Tm {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)} (_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T
--      {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ))
--      {S.El {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S._[_]t
--      {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Δ} {S.U {Δ}} a
--      (S._∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ
--      (S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}))))} x (S.π₂ {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)}))) {_[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ}
--      {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ}
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ}
--      {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ) {S.π₁ {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)})} (π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}
--      {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ}
--      {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ}
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ}
--      {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}} (id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El
--      {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)}))} {_[_]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ}
--      {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a}
--      aᶜ) {σ} σᶜ)} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {S._∘_ {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {Δ} σ (S.π₁ {Γ
--      S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)}))} (_∘_ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ)
--      {σ} σᶜ)} {Γ} {Γᶜ} {Δ} {Δᶜ} {σ} σᶜ {S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})}
--      (π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ}
--      {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ}
--      {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ}
--      {Δᶜ} {a} aᶜ) {σ} σᶜ)})))} ([][]T {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}}
--      a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ)
--      {σ} σᶜ)} {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} {El {Δ} {Δᶜ} {a} aᶜ}
--      {S.π₁ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {Γ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)})} {π₁ {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ}
--      {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U
--      {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a}
--      aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a
--      σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_
--      {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ}
--      {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)})} {σ} {σᶜ}))
--      (π₂ {Γ S.▶ S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ
--      {S.El {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ}
--      {Δᶜ} {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ)} {Γ} {Γᶜ} {S.El
--      {Γ} (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)} {_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ}
--      {S.El {Δ} a} (El {Δ} {Δᶜ} {a} aᶜ) {σ} σᶜ} {S.id {Γ S.▶ S.El {Γ}
--      (S._[_]t {Γ} {Δ} {S.U {Δ}} a σ)}} (id {Γ S.▶ S.El {Γ} (S._[_]t
--      {Γ} {Δ} {S.U {Δ}} a σ)} {_▶_ {Γ} Γᶜ {S.El {Γ} (S._[_]t {Γ} {Δ}
--      {S.U {Δ}} a σ)} (_[_]T {Γ} {Γᶜ} {Δ} {Δᶜ} {S.El {Δ} a} (El {Δ}
--      {Δᶜ} {a} aᶜ) {σ} σᶜ)})))))))
-- Π[] {Γ}{Γᶜ}{Δ}{Δᶜ}{σ}{σᶜ} {a}{aᶜ}{B}{Bᶜ} =
  -- ext λ ν → ext λ t → uñ (
  --     uncoe
  --       ((λ γ → (α : ᴬ (Tmʳ a) γ) → ᴬ (Tyʳ B) (γ , lift α)) & σᶜ ν) (λ α
  --       → coe ((λ x → Tyʳ B .ᴬ (Δᶜ (σ S.∘ ν) , lift x)) & coecoe⁻¹ (aᶜ
  --       (σ S.∘ ν)) α) (Bᶜ (σ S.∘ ν S.,s coe (aᶜ (σ S.∘ ν) ⁻¹) α) (coe
  --       cheat (S.app t S.[ S.id S.,s coe (aᶜ (σ S.∘ ν) ⁻¹) α ]t))))
  --    ◾̃ ?)     -- doesn't typecheck

app :
  {Γ : S.Con} {Γᶜ : Con Γ} {a : S.Tm Γ (S.U {Γ})} {aᶜ : Tm {Γ} Γᶜ
  {S.U {Γ}} (U {Γ} {Γᶜ}) a} {B : S.Ty (Γ S.▶ S.El {Γ} a)} {Bᶜ : Ty
  {Γ S.▶ S.El {Γ} a} (_▶_ {Γ} Γᶜ {S.El {Γ} a} (El {Γ} {Γᶜ} {a} aᶜ))
  B} {t : S.Tm Γ (S.Π {Γ} a B)} → Tm {Γ} Γᶜ {S.Π {Γ} a B} (Π {Γ}
  {Γᶜ} {a} aᶜ {B} Bᶜ) t → Tm {Γ S.▶ S.El {Γ} a} (_▶_ {Γ} Γᶜ {S.El
  {Γ} a} (El {Γ} {Γᶜ} {a} aᶜ)) {B} Bᶜ (S.app {Γ} {a} {B} t)
app {Γ}{Γᶜ}{a} {aᶜ} {B}{Bᶜ}{t} tᶜ ν =
   let α = S.π₂ ν
       ν' = S.π₁ ν
       α' = coe (aᶜ ν') α
   in uñ (
      ap2̃̃ Bᶜ (S.πη ⁻¹ ◾ (S.π₁ ν S.,s_) & (coecoe⁻¹' (aᶜ (S.π₁ ν)) (S.π₂ ν) ⁻¹ ))
              ( cheat    -- cheat : REWRITE specialization needed
              ◾̃ ap̃̃ (S._[ S.id S.,s S.π₂ ν ]t) (S.app[] {σ = S.π₁ ν}{t = t})
              ◾̃ ap̃̃ (λ x → S.app (t S.[ S.π₁ ν ]t) S.[ S.id S.,s x ]t)
                   (coecoe⁻¹' (aᶜ (S.π₁ ν)) (S.π₂ ν) ⁻¹)
              ◾̃ uncoe cheat
                (S.app (t S.[ S.π₁ ν ]t) S.[
                S.id S.,s coe (aᶜ (S.π₁ ν) ⁻¹) (coe (aᶜ (S.π₁ ν)) (S.π₂ ν)) ]t) ⁻¹̃)
    ◾̃ uncoe
      ((λ x → Tyʳ B .ᴬ (Γᶜ (S.π₁ ν) , lift x)) & coecoe⁻¹ (aᶜ (S.π₁
       ν)) (coe (aᶜ (S.π₁ ν)) (S.π₂ ν))) (Bᶜ (S.π₁ ν S.,s coe (aᶜ
       (S.π₁ ν) ⁻¹) (coe (aᶜ (S.π₁ ν)) (S.π₂ ν))) (coe cheat (S.app (t
       S.[ S.π₁ ν ]t) S.[ S.id S.,s coe (aᶜ (S.π₁ ν) ⁻¹) (coe (aᶜ
       (S.π₁ ν)) (S.π₂ ν)) ]t))) ⁻¹̃)
    ◾ ((λ f → f α') & tᶜ ν')

-- app[] : UIP
